package com.kodiiiofc.urbanuniversity.mywardrobe

class Clothes {
        val list = listOf(
            Cloth("Пиджак", R.drawable.blazer, "Классический пиджак строгого покроя. Дополнит деловой образ."),
            Cloth("Ботинки", R.drawable.boots, "Высокие кожаные ботинки. Подходят для осени и зимы, сохраняют тепло."),
            Cloth("Кепка", R.drawable.cap, "Спортивная кепка с логотипом. Защищает от солнца и дополняет повседневный стиль."),
            Cloth("Пальто", R.drawable.coat, "Классическое пальто средней длины. Отличный выбор для осенне-зимнего сезона."),
            Cloth("Пуховик", R.drawable.down_jacket, "Зимний пуховик с капюшоном. Защищает от холода и ветра."),
            Cloth("Платье", R.drawable.dress, "Легкое черное платье. Прекрасно смотрится как на прогулках, так и в формальной обстановке."),
            Cloth("Шляпа", R.drawable.hat, "Черная шляпа. Защищает от солнца и добавляет шарм образу."),
            Cloth("Толстовка", R.drawable.hoodie, "Удобная толстовка с капюшоном. Отлично сохраняет тепло и подходит для спортивного стиля."),
            Cloth("Куртка", R.drawable.jacket, "Стильная джинсовая куртка. Добавляет изюминку в любой образ и подходит для прохладной погоды."),
            Cloth("Джинсы", R.drawable.jeans, "Классические джинсы из денима. Подходят как для повседневных образов, так и для более строгих случаев."),
            Cloth("Шарф", R.drawable.scarf, "Теплый шерстяной шарф. Необходим для холодной погоды и прекрасно дополняет зимний образ."),
            Cloth("Рубашка", R.drawable.shirt, "Классическая белая рубашка с длинными рукавами. Идеальна для офисного или вечернего образа."),
            Cloth("Шорты", R.drawable.shorts, "Летние хлопковые шорты. Подходят для жаркой погоды и активного отдыха."),
            Cloth("Юбка", R.drawable.skirt, "Длинная юбка с завышенной талией. Отлично подходит для создания элегантных образов."),
            Cloth("Кеды", R.drawable.sneakers, "Удобные низкие кеды из ткани. Подходят для повседневного ношения и создают стильный повседневный образ."),
            Cloth("Свитер", R.drawable.sweater, "Теплый свитер из шерсти. Идеально подходит для холодной погоды."),
            Cloth("Футболка", R.drawable.t_shirt, "Простая хлопковая футболка с короткими рукавами. Отличный выбор для повседневного ношения."),
            Cloth("Мойка", R.drawable.tank_top, "Простая хлопковая майка. Отличный выбор для занятий спортом или как часть базового гардероба."),
            Cloth("Кроссовки", R.drawable.trainers, "Удобные спортивные кроссовки для активных прогулок или тренировок."),
            Cloth("Брюки", R.drawable.trousers, "Классические черные брюки. Подходят как для деловых встреч, так и для повседневной жизни.")
        )
}